package message

const WelcomeMessage = `Добро пожаловать в Telegram-бот системы технической поддержки Ticketly! 🎉

Рады видеть вас здесь!

Этот бот создан для того, чтобы сделать ваше взаимодействие с нашей техподдержкой максимально удобным и быстрым.

🔧 Что вы можете здесь сделать?
— Создать новый тикет по вашей проблеме или вопросу.
— Выбрать тип обращения: only-one-message или realtime-chat.
— Подробно описать ситуацию и передать её оператору.
— Получить помощь от специалиста или начать live-чат.
— Следить за статусом своего запроса.

🛠 О системе Ticketly  
Ticketly — это внутренняя система, предназначенная для обработки заявок и обеспечения качественной технической поддержки.  
Её цель — ускорить решение проблем и упростить коммуникацию между пользователем и службой поддержки.

🎫 Доступны два типа тикетов:
1. Only-One-Message — если вам нужно просто оставить обращение и получить ответ позже.
2. Realtime-Chat — для живого общения с оператором в реальном времени.

👥 Вызов оператора  
После заполнения тикета вы сможете начать диалог с оператором прямо здесь, в Telegram.

Чтобы начать — нажмите /stop и следуйте простым шагам.

📞 В экстренных ситуациях не стесняйтесь обращаться сразу!`

const HelpMessage = `✍️ *Расскажи нам, в чём проблема!* 

Опиши свою ситуацию в свободной форме — никаких сложных меню и вариантов, просто напиши, что случилось. Например:
📅 — Не могу найти своё расписание
🔒 — Забыл пароль и не могу войти
💳 — Вопрос по оплате обучения

Чем подробнее — тем быстрее поможем! 🚀

Если хочешь, можешь добавить скриншоты или ссылки, если это поможет объяснить ситуацию.`

const SentTicket = `✅ *Тикет успешно отправлен!*

🕐 Пожалуйста, ожидайте ответа от оператора.
📬 Мы свяжемся с вами в ближайшее время.`
