package message

const (
	WelcomeMessage = `👋 Добро пожаловать в службу поддержки Ticketly!

Здесь вы можете получить помощь по любым вопросам. Просто выберите удобный способ обращения:

🔹 *Отправить запрос* - если хотите оставить ваше обращение и получить ответ позже
🔹 *Чат с поддержкой* - для мгновенного общения со специалистом в реальном времени`

	HelpMessage = `✍️ *Опишите вашу проблему*

Расскажите подробно, что произошло. Это поможет нам быстрее решить вопрос. Например:
• Не получается войти в аккаунт
• Возникла проблема с оплатой
• Нашли ошибку в работе сервиса
• Нужна помощь с настройкой

Чем подробнее — тем быстрее поможем! 🚀

Если хочешь, можешь добавить скриншоты или ссылки, если это поможет объяснить ситуацию.`

	RealtimePrompt = `💬 *Опишите вопрос для чата с поддержкой*

Кратко изложите суть проблемы, и специалист подключится к разговору в реальном времени.`

	SentTicket = `✅ *Ваше обращение принято!*

Ожидайте ответа специалиста в ближайшее время.`
)
